{
  "backend/main.mo": "Main Motoko actor for the Krushna Electronics backend, defining data types (Product, Order, Cart, etc.), in-memory state maps, seeded product/category data, and CRUD/order/cart/wishlist/contact endpoints with role-based access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report confirming that the Home page hero banner was updated to apply a strong dark overlay (60–75% opacity) to obscure any embedded image text, referencing frontend/src/pages/Home.tsx and test ID REQ-15.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing the purpose and key implementation details of every page and admin component in the React app.",
  "frontend/index.css": "Global stylesheet that imports Tailwind directives and defines CSS custom properties for the light and dark theme color tokens (background, foreground, primary, sidebar, chart colors, etc.).",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, setting the page title to 'Krushna Electronics' and mounting the React root via /src/main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all public and admin routes, wraps the app in ThemeProvider (dark mode), and renders the shared Layout with Navbar, Footer, and ProfileSetupModal.",
  "frontend/src/components/admin/AdminLayout.tsx": "Provides the admin panel shell with a sidebar navigation, enforcing authentication and admin-role checks before rendering child content.",
  "frontend/src/components/Footer.tsx": "Site footer component displaying the brand logo, quick navigation links, contact information (address, phone, email, hours), and social media icon links.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with logo, desktop nav links, a search form, cart/wishlist badge icons, and a user dropdown menu supporting Internet Identity login/logout and admin dashboard access.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, star rating, wishlist toggle, and add-to-cart button, redirecting unauthenticated users to login.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal dialog prompting newly authenticated users without a profile to enter their name and email to complete setup.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Fetches the currently authenticated caller's user profile from the backend actor using React Query, waiting until the actor is ready.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context provider and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Exports a collection of React Query hooks for all backend operations including products, categories, cart, orders, wishlist, users, and admin actions.",
  "frontend/src/index.css": "Global CSS file that imports Inter and Rajdhani fonts, sets up Tailwind, and defines a dark navy/neon-cyan electronics showroom theme with CSS custom properties for both light and dark modes, plus utility classes for neon effects and scrollbar styling.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack Query's QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/About.tsx": "Static About page for Krushna Electronics displaying company stats, mission/vision cards, and a timeline of milestones from 2010 to 2026.",
  "frontend/src/pages/admin/Dashboard.tsx": "The Admin Dashboard displays store stats (users, products, orders, sales) in stat cards, with access control checks for authentication and admin role.",
  "frontend/src/pages/admin/OrderManagement.tsx": "Admin page that lists all orders in a table and allows updating each order's status (pending, processing, shipped, delivered, cancelled) via a dropdown select with toast notifications.",
  "frontend/src/pages/admin/ProductManagement.tsx": "Admin page for full CRUD management of products, including add/edit via a dialog form, delete with confirmation, and inline stock editing, all backed by React Query hooks with toast feedback.",
  "frontend/src/pages/admin/UserManagement.tsx": "Admin page that displays all registered users in a table and allows changing each user's role (admin/user) via a dropdown, using the assignRole mutation with toast notifications.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page that fetches cart items and product details, allows quantity updates and item removal, and displays a subtotal summary with a checkout navigation button.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a shipping address form, payment method selection, and order summary; on submission it calls createOrder and shows a confirmation screen with the placed order details.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying store address, phone, email, and hours alongside a validated contact form that submits messages via the useSubmitContactMessage mutation and shows a success state on completion.",
  "frontend/src/pages/Home.tsx": "The Home page displays a hero banner, featured products, category grid, testimonials, and feature highlights using data fetched via React Query hooks.",
  "frontend/src/pages/Login.tsx": "The Login page provides Internet Identity-based authentication, redirecting already-authenticated users to the home page and showing feature benefits to new users.",
  "frontend/src/pages/ProductDetails.tsx": "The ProductDetails page renders a single product's images, specs, pricing, add-to-cart/wishlist actions, and a related products section fetched by category.",
  "frontend/src/pages/Shop.tsx": "The Shop page lists all products with client-side filtering by category, price range, and search query, plus sorting options and a toggleable filter panel.",
  "frontend/src/pages/Wishlist.tsx": "The Wishlist page shows saved products for authenticated users, cross-referencing wishlist IDs with all products, with empty-state and unauthenticated-state handling.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read URL query parameters (supporting both standard and hash-based routing), persist them to sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH-based color tokens (navy, neon-cyan/teal, semantic UI colors), custom fonts, border radii, neon box shadows, and keyframe animations.",
  "project_state.json": "Tracks the full project state (version 5) for 'Krushna Electronics', a local full-stack e-commerce site built with Node.js/Express, SQLite3, and HTML/CSS/JS, documenting architecture, existing features, known issues, and image requirements."
}